import numpy as np
import cv2
import time
import os
import matplotlib.pyplot as plt
import pandas as pd
black = (0,0,0)
white = (255,255,255)


canvas = np.zeros((550, 600, 3), dtype="uint8")

#第一次




while 1:
    #1
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    time.sleep(0.0001)
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 100), (350, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 200), (450, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #2
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 100), (350, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 200), (450, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)


    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)


    #3
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 150), (350, 250), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 250), (450, 150), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)



    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #4
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 150), (350, 250), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 250), (450, 150), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)


    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #5
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 200), (350, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 300), (450, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)



    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #6
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 200), (350, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 300), (450, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)
    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)


    #7
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 250), (350, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 350), (450, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)


    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #8
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 250), (350, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 350), (450, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)


    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #9
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 300), (350, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 400), (450, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)


    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #10
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 300), (350, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 400), (450, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    #11
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 350), (350, 450), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 450), (450, 350), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)


    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)
    #12
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 350), (350, 450), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 450), (450, 350), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    # 13
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 350), (300, 450), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 450), (400, 350), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    # 14
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 350), (300, 450), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 450), (400, 350), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    # 15
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 300), (300, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 400), (400, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.00001)

    # 16
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 300), (300, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 400), (400, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 17
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 250), (300, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 350), (400, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 18
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 250), (300, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 350), (400, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 19
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 200), (300, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 300), (400, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)

    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 20
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 200), (300, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 300), (400, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 21
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 150), (300, 250), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 250), (400, 150), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 22
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 150), (300, 250), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 250), (400, 150), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    #23
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 100), (300, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 200), (400, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 24
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 100), (300, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 200), (400, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 25
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 100), (250, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 200), (350, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.001)

    # 26
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 100), (250, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 200), (350, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 27
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 150), (250, 250), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 250), (350, 150), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 28
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 150), (250, 250), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 250), (350, 150), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 29
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 200), (250, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 300), (350, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 30
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 200), (250, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 300), (350, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 31
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 250), (250, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 350), (350, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 32
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 250), (250, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 350), (350, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 33
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 300), (250, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 400), (350, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)
    # 34
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 300), (250, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 400), (350, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 35
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 350), (250, 450), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 450), (350, 350), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)
    # 36
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 350), (250, 450), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 450), (350, 350), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 33
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 300), (250, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 400), (350, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 34
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 300), (250, 400), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 400), (350, 300), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 31
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 250), (250, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 350), (350, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 32
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 250), (250, 350), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 350), (350, 250), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 29
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 200), (250, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 300), (350, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 30
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 200), (250, 300), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 300), (350, 200), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 27
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 150), (250, 250), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 250), (350, 150), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 28
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 100), (250, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 200), (350, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 26
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (150, 100), (250, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (250, 200), (350, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 25
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 100), (300, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 200), (400, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 24
    cv2.line(canvas, (250, 100), (250, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (250, 250), (250, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (250, 400), (250, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (150, 200), (150, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (200, 100), (300, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (300, 200), (400, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

    # 23
    cv2.line(canvas, (150, 100), (150, 150), (42, 203, 245), 48)  # 画直线  黄色  左上方一点
    cv2.line(canvas, (150, 250), (150, 300), (42, 203, 245), 48)  # 画直线      左中一点
    cv2.line(canvas, (150, 400), (150, 450), (42, 203, 245), 48)  # 画直线       左下一点
    cv2.line(canvas, (250, 200), (250, 450), (42, 203, 245), 48)  # 画直线     中一素

    cv2.line(canvas, (350, 100), (450, 100), (195, 129, 66), 48)  # 画直线   蓝色 右上一横
    cv2.line(canvas, (450, 100), (450, 200), (195, 129, 66), 48)  # 画直线       右上一竖
    cv2.line(canvas, (350, 300), (350, 450), (195, 129, 66), 48)  # 画直线  蓝色   右下一竖
    cv2.line(canvas, (350, 450), (450, 450), (195, 129, 66), 48)  # 画直线      右下一横
    cv2.line(canvas, (350, 450), (450, 350), (195, 129, 66), 48)  # 画直线  xiexian   右下一撇

    cv2.line(canvas, (250, 100), (350, 200), (63, 53, 202), 48)  # 画直线   红色爱心  红色一捺
    cv2.line(canvas, (350, 200), (450, 100), (63, 53, 202), 48)  # 画直线   红色爱心   红色一撇

    cv2.imshow("Canvas", canvas)
    cv2.waitKey(1)

    time.sleep(0.15)
    cv2.rectangle(canvas, (0, 0), (600, 550), white, -1)
    cv2.waitKey(1)

    time.sleep(0.0001)

   #41张，5秒


